Revit 2027 API
MultiSegmentGrid.Text Property
 name shared by grids in this MultiSegmentGrid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
public:
property String^ Text {
	String^ get ();
	void set (String^ value);
}
member Text : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MultiSegmentGrid Class
Autodesk.Revit.DB Namespace